apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbdev.c
/*******************************************************************************
 * arch/arm/src/lpc313x/lpc313x_usbdev.c
 *
 *   Author: Davide Hewson
 *
 * Part of the NuttX OS and based, in part, on the LPC2148 USB driver:
 *
 *   Copyright (C) 2010 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 *******************************************************************************/

/*******************************************************************************
 * Included Files
 *******************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/usb.h>
#include <nuttx/usbdev.h>
#include <nuttx/usbdev_trace.h>

#include <arch/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"

#include "lpc313x_usbotg.h"
#include "lpc313x_evntrtr.h"
#include "lpc313x_syscreg.h"

/*******************************************************************************
 * Definitions
 *******************************************************************************/

/* Configuration ***************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef  CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

/* Extremely detailed register debug that you would normally never want
 * enabled.
 */

#undef CONFIG_LPC313X_USBDEV_REGDEBUG

/* Enable reading SOF from interrupt handler vs. simply reading on demand.  Probably
 * a bad idea... Unless there is some issue with sampling the SOF from hardware
 * asynchronously.
 */

#ifdef CONFIG_LPC313X_USBDEV_FRAME_INTERRUPT
#  define USB_FRAME_INT USBDEV_USBINTR_SRE
#else
#  define USB_FRAME_INT 0
#endif

#ifdef CONFIG_DEBUG
#  define USB_ERROR_INT USBDEV_USBINTR_UEE
#else
#  define USB_ERROR_INT 0
#endif

/* Debug ***********************************************************************/

/* Trace error codes */

#define LPC313X_TRACEERR_ALLOCFAIL            0x0001
#define LPC313X_TRACEERR_BADCLEARFEATURE      0x0002
#define LPC313X_TRACEERR_BADDEVGETSTATUS      0x0003
#define LPC313X_TRACEERR_BADEPNO              0x0004
#define LPC313X_TRACEERR_BADEPGETSTATUS       0x0005
#define LPC313X_TRACEERR_BADEPTYPE            0x0006
#define LPC313X_TRACEERR_BADGETCONFIG         0x0007
#define LPC313X_TRACEERR_BADGETSETDESC        0x0008
#define LPC313X_TRACEERR_BADGETSTATUS         0x0009
#define LPC313X_TRACEERR_BADSETADDRESS        0x000a
#define LPC313X_TRACEERR_BADSETCONFIG         0x000b
#define LPC313X_TRACEERR_BADSETFEATURE        0x000c
#define LPC313X_TRACEERR_BINDFAILED           0x000d
#define LPC313X_TRACEERR_DISPATCHSTALL        0x000e
#define LPC313X_TRACEERR_DRIVER               0x000f
#define LPC313X_TRACEERR_DRIVERREGISTERED     0x0010
#define LPC313X_TRACEERR_EP0SETUPSTALLED      0x0011
#define LPC313X_TRACEERR_EPINNULLPACKET       0x0012
#define LPC313X_TRACEERR_EPOUTNULLPACKET      0x0013
#define LPC313X_TRACEERR_INVALIDCTRLREQ       0x0014
#define LPC313X_TRACEERR_INVALIDPARMS         0x0015
#define LPC313X_TRACEERR_IRQREGISTRATION      0x0016
#define LPC313X_TRACEERR_NOEP                 0x0017
#define LPC313X_TRACEERR_NOTCONFIGURED        0x0018
#define LPC313X_TRACEERR_REQABORTED           0x0019

/* Trace interrupt codes */

#define LPC313X_TRACEINTID_USB                0x0001
#define LPC313X_TRACEINTID_CLEARFEATURE       0x0002
#define LPC313X_TRACEINTID_DEVGETSTATUS       0x0003
#define LPC313X_TRACEINTID_DEVRESET           0x0004
#define LPC313X_TRACEINTID_DISPATCH           0x0005
#define LPC313X_TRACEINTID_EP0COMPLETE        0x0006
#define LPC313X_TRACEINTID_EP0NAK             0x0007
#define LPC313X_TRACEINTID_EP0SETUP           0x0008
#define LPC313X_TRACEINTID_EPGETSTATUS        0x0009
#define LPC313X_TRACEINTID_EPIN               0x000a
#define LPC313X_TRACEINTID_EPINQEMPTY         0x000b
#define LPC313X_TRACEINTID_EP0INSETADDRESS    0x000c
#define LPC313X_TRACEINTID_EPOUT              0x000d
#define LPC313X_TRACEINTID_EPOUTQEMPTY        0x000e
#define LPC313X_TRACEINTID_EP0SETUPSETADDRESS 0x000f
#define LPC313X_TRACEINTID_FRAME              0x0010
#define LPC313X_TRACEINTID_GETCONFIG          0x0011
#define LPC313X_TRACEINTID_GETSETDESC         0x0012
#define LPC313X_TRACEINTID_GETSETIF           0x0013
#define LPC313X_TRACEINTID_GETSTATUS          0x0014
#define LPC313X_TRACEINTID_IFGETSTATUS        0x0015
#define LPC313X_TRACEINTID_SETCONFIG          0x0016
#define LPC313X_TRACEINTID_SETFEATURE         0x0017
#define LPC313X_TRACEINTID_SUSPENDCHG         0x0018
#define LPC313X_TRACEINTID_SYNCHFRAME         0x0019

/* Hardware interface **********************************************************/

/* This represents a Endpoint Transfer Descriptor - note these must be 32 byte aligned */
struct lpc313x_dtd_s
{
  volatile uint32_t       nextdesc;      /* Address of the next DMA descripto in RAM */
  volatile uint32_t       config;        /* Misc. bit encoded configuration information */
  uint32_t                buffer0;       /* Buffer start address */
  uint32_t                buffer1;       /* Buffer start address */
  uint32_t                buffer2;       /* Buffer start address */
  uint32_t                buffer3;       /* Buffer start address */
  uint32_t                buffer4;       /* Buffer start address */
  uint32_t                xfer_len;      /* Software only - transfer len that was queued */
};

/* DTD nextdesc field*/
#define DTD_NEXTDESC_INVALID		(1 << 0)	/* Bit 0     : Next Descriptor Invalid */

/* DTD config field */
#define DTD_CONFIG_LENGTH(n)		((n) << 16)	/* Bits 16-31 : Total bytes to transfer */
#define DTD_CONFIG_IOC			(1 << 15)	/* Bit 15     : Interrupt on Completion */
#define DTD_CONFIG_MULT_VARIABLE	(0 << 10)	/* Bits 10-11 : Number of packets executed per transacation descriptor (override) */
#define DTD_CONFIG_MULT_NUM(n)		((n) << 10)
#define DTD_CONFIG_ACTIVE		(1 << 7)	/* Bit 7      : Status Active */
#define DTD_CONFIG_HALTED		(1 << 6)	/* Bit 6      : Status Halted */
#define DTD_CONFIG_BUFFER_ERROR		(1 << 5)	/* Bit 6      : Status Buffer Error */
#define DTD_CONFIG_TRANSACTION_ERROR	(1 << 3)	/* Bit 3      : Status Transaction Error */

