apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbdev.c
/* This represents a queue head  - not these must be aligned to a 2048 byte boundary */
struct lpc313x_dqh_s
{
  uint32_t                capability;	/* Endpoint capability */
  uint32_t                currdesc;	/* Current dTD pointer */
  struct lpc313x_dtd_s    overlay;	/* DTD overlay */
  volatile uint32_t       setup[2];	/* Set-up buffer */
  uint32_t                gap[4];	/* align to 64 bytes */
};

/* DQH capability field */
#define DQH_CAPABILITY_MULT_VARIABLE	(0 << 30)	/* Bits 30-31 : Number of packets executed per transaction descriptor */
#define DQH_CAPABILITY_MULT_NUM(n)	((n) << 30)
#define DQH_CAPABILITY_ZLT		(1 << 29)	/* Bit 29     : Zero Length Termination Select */
#define DQH_CAPABILITY_MAX_PACKET(n)	((n) << 16)	/* Bits 16-29 : Maximum packet size of associated endpoint (<1024) */
#define DQH_CAPABILITY_IOS		(1 << 15)	/* Bit 15     : Interrupt on Setup */

/* Endpoints ******************************************************************/

/* Number of endpoints */
#define LPC313X_NLOGENDPOINTS        (4)          /* ep0-3 */
#define LPC313X_NPHYSENDPOINTS       (8)          /* x2 for IN and OUT */

/* Odd physical endpoint numbers are IN; even are OUT */
#define LPC313X_EPPHYIN(epphy)       (((epphy)&1)!=0)
#define LPC313X_EPPHYOUT(epphy)      (((epphy)&1)==0)

#define LPC313X_EPPHYIN2LOG(epphy)   (((uint8_t)(epphy)>>1)|USB_DIR_IN)
#define LPC313X_EPPHYOUT2LOG(epphy)  (((uint8_t)(epphy)>>1)|USB_DIR_OUT)

/* Endpoint 0 is special... */
#define LPC313X_EP0_OUT		        (0)
#define LPC313X_EP0_IN		        (1)

/* Each endpoint has somewhat different characteristics */
#define LPC313X_EPALLSET                (0xff)        /* All endpoints */
#define LPC313X_EPOUTSET                (0x55)        /* Even phy endpoint numbers are OUT EPs */
#define LPC313X_EPINSET                 (0xaa)        /* Odd endpoint numbers are IN EPs */
#define LPC313X_EPCTRLSET               (0x03)        /* EP0 IN/OUT are control endpoints */
#define LPC313X_EPINTRSET               (0xa8)        /* Interrupt endpoints */
#define LPC313X_EPBULKSET               (0xfc)        /* Bulk endpoints */
#define LPC313X_EPISOCSET               (0xfc)        /* Isochronous endpoints */

/* Maximum packet sizes for endpoints */
#define LPC313X_EP0MAXPACKET            (64)          /* EP0 max packet size (1-64) */
#define LPC313X_BULKMAXPACKET           (512)         /* Bulk endpoint max packet (8/16/32/64/512) */
#define LPC313X_INTRMAXPACKET           (1024)        /* Interrupt endpoint max packet (1 to 1024) */
#define LPC313X_ISOCMAXPACKET           (512)         /* Acutally 1..1023 */

/* The address of the endpoint control register */
#define LPC313X_USBDEV_ENDPTCTRL(epphy) (LPC313X_USBDEV_ENDPTCTRL0 + ((epphy)>>1)*4)

/* Endpoint bit position in SETUPSTAT, PRIME, FLUSH, STAT, COMPLETE registers */
#define LPC313X_ENDPTSHIFT(epphy)      (LPC313X_EPPHYIN(epphy) ? (16 + ((epphy) >> 1)) : ((epphy) >> 1))
#define LPC313X_ENDPTMASK(epphy)       (1 << LPC313X_ENDPTSHIFT(epphy))
#define LPC313X_ENDPTMASK_ALL	        0x000f000f

/* Request queue operations ****************************************************/

#define lpc313x_rqempty(ep)          ((ep)->head == NULL)
#define lpc313x_rqpeek(ep)           ((ep)->head)

/*******************************************************************************
 * Private Types
 *******************************************************************************/

/* A container for a request so that the request may be retained in a list */

struct lpc313x_req_s
{
  struct usbdev_req_s    req;           /* Standard USB request */
  struct lpc313x_req_s  *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct lpc313x_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct lpc313x_ep_s.
   */

  struct usbdev_ep_s      ep;            /* Standard endpoint structure */

  /* LPC313X-specific fields */

  struct lpc313x_usbdev_s *dev;          /* Reference to private driver data */
  struct lpc313x_req_s    *head;         /* Request list for this endpoint */
  struct lpc313x_req_s    *tail;
  uint8_t                 epphy;         /* Physical EP address */
  uint8_t                 stalled:1;     /* 1: Endpoint is stalled */
};

/* This structure retains the state of the USB device controller */

struct lpc313x_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to struct lpc313x_usbdev_s.
   */

  struct usbdev_s         usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* LPC313X-specific fields */

  uint8_t                 ep0state;      /* State of certain EP0 operations */
  uint8_t                 ep0buf[64];	 /* buffer for EP0 short transfers */
  uint8_t                 paddr;         /* Address assigned by SETADDRESS */
  uint8_t                 stalled:1;     /* 1: Protocol stalled */
  uint8_t                 selfpowered:1; /* 1: Device is self powered */
  uint8_t                 paddrset:1;    /* 1: Peripheral addr has been set */
  uint8_t                 attached:1;    /* 1: Host attached */
  uint32_t                softprio;      /* Bitset of high priority interrupts */
  uint32_t                epavail;       /* Bitset of available endpoints */
#ifdef CONFIG_LPC313X_USBDEV_FRAME_INTERRUPT
  uint32_t                sof;           /* Last start-of-frame */
#endif

  /* The endpoint list */
  struct lpc313x_ep_s     eplist[LPC313X_NPHYSENDPOINTS];
};

#define EP0STATE_IDLE			0		/* Idle State, leave on receiving a setup packet or epsubmit */
#define EP0STATE_SETUP_OUT		1		/* Setup Packet received - SET/CLEAR */
#define EP0STATE_SETUP_IN		2		/* Setup Packet received - GET */
#define EP0STATE_SHORTWRITE		3		/* Short write without a usb_request */
#define EP0STATE_WAIT_NAK_OUT		4		/* Waiting for Host to illicit status phase (GET) */
#define EP0STATE_WAIT_NAK_IN		5		/* Waiting for Host to illicit status phase (SET/CLEAR) */
#define EP0STATE_WAIT_STATUS_OUT	6		/* Wait for status phase to complete */
#define EP0STATE_WAIT_STATUS_IN		7		/* Wait for status phase to complete */
#define EP0STATE_DATA_IN		8
#define EP0STATE_DATA_OUT		9

