apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbdev.c
/*******************************************************************************
 * Private Function Prototypes
 *******************************************************************************/

/* Register operations ********************************************************/

#if defined(CONFIG_LPC313X_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG)
static uint32_t lpc313x_getreg(uint32_t addr);
static void lpc313x_putreg(uint32_t val, uint32_t addr);
#else
# define lpc313x_getreg(addr)     getreg32(addr)
# define lpc313x_putreg(val,addr) putreg32(val,addr)
#endif

static inline void lpc313x_clrbits(uint32_t mask, uint32_t addr);
static inline void lpc313x_setbits(uint32_t mask, uint32_t addr);
static inline void lpc313x_chgbits(uint32_t mask, uint32_t val, uint32_t addr);

/* Request queue operations ****************************************************/

static FAR struct lpc313x_req_s *lpc313x_rqdequeue(FAR struct lpc313x_ep_s *privep);
static bool                      lpc313x_rqenqueue(FAR struct lpc313x_ep_s *privep,
						   FAR struct lpc313x_req_s *req);

/* Low level data transfers and request operations *****************************/

static inline void lpc313x_writedtd(struct lpc313x_dtd_s *dtd, const uint8_t *data, uint32_t nbytes);
static inline void lpc313x_queuedtd(uint8_t epphy, struct lpc313x_dtd_s *dtd);
static inline void lpc313x_ep0xfer(uint8_t epphy, uint8_t *data, uint32_t nbytes);
static void        lpc313x_readsetup(uint8_t epphy, struct usb_ctrlreq_s *ctrl);

static inline void lpc313x_set_address(struct lpc313x_usbdev_s *priv, uint16_t address);

static void        lpc313x_flushep(struct lpc313x_ep_s *privep);

static int         lpc313x_progressep(struct lpc313x_ep_s *privep);
static inline void lpc313x_abortrequest(struct lpc313x_ep_s *privep,
					struct lpc313x_req_s *privreq, int16_t result);
static void        lpc313x_reqcomplete(struct lpc313x_ep_s *privep, struct lpc313x_req_s *privreq, int16_t result);

static void        lpc313x_cancelrequests(struct lpc313x_ep_s *privep, int16_t status);

/* Interrupt handling **********************************************************/
static struct lpc313x_ep_s *lpc313x_epfindbyaddr(struct lpc313x_usbdev_s *priv, uint16_t eplog);
static void                 lpc313x_dispatchrequest(struct lpc313x_usbdev_s *priv, const struct usb_ctrlreq_s *ctrl);
static void                 lpc313x_ep0configure(struct lpc313x_usbdev_s *priv);
static void                 lpc313x_usbreset(struct lpc313x_usbdev_s *priv);

static inline void          lpc313x_ep0state(struct lpc313x_usbdev_s *priv, uint16_t state);
static void                 lpc313x_ep0setup(struct lpc313x_usbdev_s *priv);

static void                 lpc313x_ep0complete(struct lpc313x_usbdev_s *priv, uint8_t epphy);
static void                 lpc313x_ep0nak(struct lpc313x_usbdev_s *priv, uint8_t epphy);
static bool                 lpc313x_epcomplete(struct lpc313x_usbdev_s *priv, uint8_t epphy);

static int                  lpc313x_usbinterrupt(int irq, FAR void *context);

/* Endpoint operations *********************************************************/

/* USB device controller operations ********************************************/

static int  lpc313x_epconfigure(FAR struct usbdev_ep_s *ep,
              const struct usb_epdesc_s *desc, bool last);
static int  lpc313x_epdisable(FAR struct usbdev_ep_s *ep);
static FAR struct usbdev_req_s *lpc313x_epallocreq(FAR struct usbdev_ep_s *ep);
static void lpc313x_epfreereq(FAR struct usbdev_ep_s *ep,
              FAR struct usbdev_req_s *);
static void *lpc313x_epallocbuffer(FAR struct usbdev_ep_s *ep, unsigned bytes);
static void lpc313_epfreebuffer(FAR struct usbdev_ep_s *ep, FAR void *buf);
static int  lpc313x_epsubmit(FAR struct usbdev_ep_s *ep,
              struct usbdev_req_s *req);
static int  lpc313x_epcancel(FAR struct usbdev_ep_s *ep,
              struct usbdev_req_s *req);
static int  lpc313x_epstall(FAR struct usbdev_ep_s *ep, bool resume);

static FAR struct usbdev_ep_s *lcp313x_allocep(FAR struct usbdev_s *dev,
					       uint8_t epno, bool in, uint8_t eptype);
static void lpc313x_freeep(FAR struct usbdev_s *dev, FAR struct usbdev_ep_s *ep);
static int  lpc313x_getframe(struct usbdev_s *dev);
static int  lpc313x_wakeup(struct usbdev_s *dev);
static int  lpc313x_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int  lpc313x_pullup(struct usbdev_s *dev, bool enable);

/*******************************************************************************
 * Private Data
 *******************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct lpc313x_usbdev_s g_usbdev;

static struct lpc313x_dqh_s __attribute__((aligned(2048))) g_qh[LPC313X_NPHYSENDPOINTS];
static struct lpc313x_dtd_s __attribute__((aligned(32)))   g_td[LPC313X_NPHYSENDPOINTS];

static const struct usbdev_epops_s g_epops =
{
  .configure   = lpc313x_epconfigure,
  .disable     = lpc313x_epdisable,
  .allocreq    = lpc313x_epallocreq,
  .freereq     = lpc313x_epfreereq,
#ifdef CONFIG_ARCH_USBDEV_DMA
  .allocbuffer = lpc313x_epallocbuffer,
  .freebuffer  = lpc313x_epfreebuffer,
#endif
  .submit      = lpc313x_epsubmit,
  .cancel      = lpc313x_epcancel,
  .stall       = lpc313x_epstall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = lcp313x_allocep,
  .freeep      = lpc313x_freeep,
  .getframe    = lpc313x_getframe,
  .wakeup      = lpc313x_wakeup,
  .selfpowered = lpc313x_selfpowered,
  .pullup      = lpc313x_pullup,
};

/*******************************************************************************
 * Public Data
 *******************************************************************************/

/*******************************************************************************
 * Private Functions
 *******************************************************************************/

