apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbdev.c
static inline void lpc313x_ep0xfer(uint8_t epphy, uint8_t *buf, uint32_t nbytes)
{
  struct lpc313x_dtd_s *dtd = &g_td[epphy];

  lpc313x_writedtd(dtd, buf, nbytes);
    
  lpc313x_queuedtd(epphy, dtd);
}

/*******************************************************************************
 * Name: lpc313x_readsetup
 *
 * Description:
 *   Read a Setup packet from the DTD.
 *
 *******************************************************************************/
static void lpc313x_readsetup(uint8_t epphy, struct usb_ctrlreq_s *ctrl)
{
    struct lpc313x_dqh_s *dqh = &g_qh[epphy];
    int i;

    do {
	/* Set the trip wire */
	lpc313x_setbits(USBDEV_USBCMD_SUTW, LPC313X_USBDEV_USBCMD);

	// copy the request...
	for (i = 0; i < 8; i++)
	    ((uint8_t *) ctrl)[i] = ((uint8_t *) dqh->setup)[i];
	
    } while (!(lpc313x_getreg(LPC313X_USBDEV_USBCMD) & USBDEV_USBCMD_SUTW));
    
    /* Clear the trip wire */
    lpc313x_clrbits(USBDEV_USBCMD_SUTW, LPC313X_USBDEV_USBCMD);

    /* Clear the Setup Interrupt */
    lpc313x_putreg (LPC313X_ENDPTMASK(LPC313X_EP0_OUT), LPC313X_USBDEV_ENDPTSETUPSTAT);
}

/*******************************************************************************
 * Name: lpc313x_set_address
 *
 * Description:
 *   Set the devices USB address
 *
 *******************************************************************************/

static inline void lpc313x_set_address(struct lpc313x_usbdev_s *priv, uint16_t address)
{
  priv->paddr    = address;
  priv->paddrset = address != 0;

  lpc313x_chgbits(USBDEV_DEVICEADDR_MASK, priv->paddr << USBDEV_DEVICEADDR_SHIFT, 
		  LPC313X_USBDEV_DEVICEADDR);
}

/*******************************************************************************
 * Name: lpc313x_flushep
 *
 * Description:
 *   Flush any primed descriptors from this ep
 *
 *******************************************************************************/

static void lpc313x_flushep(struct lpc313x_ep_s *privep)
{
  uint32_t mask = LPC313X_ENDPTMASK(privep->epphy);
  do {
      lpc313x_putreg (mask, LPC313X_USBDEV_ENDPTFLUSH);
      while ((lpc313x_getreg(LPC313X_USBDEV_ENDPTFLUSH) & mask) != 0)
	;
  } while ((lpc313x_getreg(LPC313X_USBDEV_ENDPTSTATUS) & mask) != 0);
}


/*******************************************************************************
 * Name: lpc313x_progressep
 *
 * Description:
 *   Progress the Endpoint by priming the first request into the queue head
 *
 *******************************************************************************/

static int lpc313x_progressep(struct lpc313x_ep_s *privep)
{
  struct lpc313x_dtd_s *dtd = &g_td[privep->epphy];
  struct lpc313x_req_s *privreq;

  /* Check the request from the head of the endpoint request queue */

  privreq = lpc313x_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EPINQEMPTY), 0);
      return OK;
    }

  /* Ignore any attempt to send a zero length packet */

  if (privreq->req.len == 0)
    {
	/* If the class driver is responding to a setup packet, then wait for the 
	 * host to illicit thr response */

	if (privep->epphy == LPC313X_EP0_IN && privep->dev->ep0state == EP0STATE_SETUP_OUT)
	  lpc313x_ep0state (privep->dev, EP0STATE_WAIT_NAK_IN);
	else
	  {
	    if (LPC313X_EPPHYIN(privep->epphy))
		usbtrace(TRACE_DEVERROR(LPC313X_TRACEERR_EPINNULLPACKET), 0);
	    else
		usbtrace(TRACE_DEVERROR(LPC313X_TRACEERR_EPOUTNULLPACKET), 0);
	  }
	  
      lpc313x_reqcomplete(privep, lpc313x_rqdequeue(privep), OK);
      return OK;
    }

  if (privep->epphy == LPC313X_EP0_IN)
    lpc313x_ep0state (privep->dev,  EP0STATE_DATA_IN);
  else if (privep->epphy == LPC313X_EP0_OUT)
    lpc313x_ep0state (privep->dev, EP0STATE_DATA_OUT);

  int bytesleft = privreq->req.len - privreq->req.xfrd;

  if (LPC313X_EPPHYIN(privep->epphy))
    usbtrace(TRACE_WRITE(privep->epphy), privreq->req.xfrd);
  else
    usbtrace(TRACE_READ(privep->epphy), privreq->req.xfrd);

  /* Initialise the DTD to transfer the next chunk */

  lpc313x_writedtd (dtd, privreq->req.buf + privreq->req.xfrd, bytesleft);

  /* then queue onto the DQH */
  lpc313x_queuedtd(privep->epphy, dtd);

  return OK;
}

/*******************************************************************************
 * Name: lpc313x_abortrequest
 *
 * Description:
 *   Discard a request
 *
 *******************************************************************************/

static inline void lpc313x_abortrequest(struct lpc313x_ep_s *privep,
                                        struct lpc313x_req_s *privreq,
                                        int16_t result)
{
  usbtrace(TRACE_DEVERROR(LPC313X_TRACEERR_REQABORTED), (uint16_t)privep->epphy);

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);
}

/*******************************************************************************
 * Name: lpc313x_reqcomplete
 *
 * Description:
 *   Handle termination of the request at the head of the endpoint request queue.
 *
 *******************************************************************************/

static void lpc313x_reqcomplete(struct lpc313x_ep_s *privep, struct lpc313x_req_s *privreq, int16_t result)
{
  /* If endpoint 0, temporarily reflect the state of protocol stalled
   * in the callback.
   */

  bool stalled = privep->stalled;
  if (privep->epphy == LPC313X_EP0_IN)
    privep->stalled = privep->dev->stalled;

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);

  /* Restore the stalled indication */

  privep->stalled = stalled;
}

/*******************************************************************************
 * Name: lpc313x_cancelrequests
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 *******************************************************************************/

static void lpc313x_cancelrequests(struct lpc313x_ep_s *privep, int16_t status)
{
  if (!lpc313x_rqempty(privep))
      lpc313x_flushep(privep);

  while (!lpc313x_rqempty(privep))
    {
      // FIXME: the entry at the head should be sync'd with the DTD
      // FIXME: only report the error status if the transfer hasn't completed
      usbtrace(TRACE_COMPLETE(privep->epphy),
               (lpc313x_rqpeek(privep))->req.xfrd);
      lpc313x_reqcomplete(privep, lpc313x_rqdequeue(privep), status);
    }
}

