apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbdev.c
/*******************************************************************************
 * Name: lpc313x_ep0nak
 *
 * Description:
 *   Handle a NAK interrupt on EP0
 *
 *******************************************************************************/

static void lpc313x_ep0nak(struct lpc313x_usbdev_s *priv, uint8_t epphy)
{
  usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EP0NAK), (uint16_t)priv->ep0state);

  switch (priv->ep0state)
    {
    case EP0STATE_WAIT_NAK_IN:
      lpc313x_ep0xfer (LPC313X_EP0_IN, NULL, 0);
      lpc313x_ep0state (priv, EP0STATE_WAIT_STATUS_IN);
      break;
    case EP0STATE_WAIT_NAK_OUT:
      lpc313x_ep0xfer (LPC313X_EP0_OUT, NULL, 0);
      lpc313x_ep0state (priv, EP0STATE_WAIT_STATUS_OUT);
      break;
    default:
#ifdef CONFIG_DEBUG
      DEBUGASSERT(priv->ep0state != EP0STATE_WAIT_NAK_IN &&
		  priv->ep0state != EP0STATE_WAIT_NAK_OUT);
#endif
      priv->stalled = true;
      break;
    }
  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(LPC313X_TRACEERR_EP0SETUPSTALLED), priv->ep0state);
      lpc313x_epstall(&priv->eplist[LPC313X_EP0_IN].ep, false);
      lpc313x_epstall(&priv->eplist[LPC313X_EP0_OUT].ep, false);
    }
}

/*******************************************************************************
 * Name: lpc313x_epcomplete
 *
 * Description:
 *   Transfer complete handler for Endpoints other than 0
 *   returns whether the request at the head has completed
 *
 *******************************************************************************/

bool
lpc313x_epcomplete(struct lpc313x_usbdev_s *priv, uint8_t epphy)
{
  struct lpc313x_ep_s  *privep  = &priv->eplist[epphy];
  struct lpc313x_req_s *privreq = privep->head;
  struct lpc313x_dtd_s *dtd     = &g_td[epphy];

  if (privreq == NULL)		/* This shouldn't really happen */
  {
    if (LPC313X_EPPHYOUT(privep->epphy))
      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EPINQEMPTY), 0);
    else
      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EPOUTQEMPTY), 0);
    return true;
  }
    
  int xfrd = dtd->xfer_len - (dtd->config >> 16);
    
  privreq->req.xfrd += xfrd;

  bool complete = true;
  if (LPC313X_EPPHYOUT(privep->epphy))
    {
      /* read(OUT) completes when request filled, or a short transfer is received */

      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EPIN), complete);
    }
  else
    {
      /* write(IN) completes when request finished, unless we need to terminate with a ZLP */

      bool need_zlp = (xfrd == privep->ep.maxpacket) && ((privreq->req.flags & USBDEV_REQFLAGS_NULLPKT) != 0);

      complete = (privreq->req.xfrd >= privreq->req.len && !need_zlp);

      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EPOUT), complete);
    }

  /* If the transfer is complete, then dequeue and progress any further queued requests */

  if (complete)
    {
      privreq = lpc313x_rqdequeue (privep);
    }
    
  if (!lpc313x_rqempty(privep))
    {
      lpc313x_progressep(privep);
    }

  /* Now it's safe to call the completion callback as it may well submit a new request */

  if (complete)
    {
      usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);
      lpc313x_reqcomplete(privep, privreq, OK);
    }

  return complete;
}


/*******************************************************************************
 * Name: lpc313x_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 *******************************************************************************/

static int lpc313x_usbinterrupt(int irq, FAR void *context)
{
  struct lpc313x_usbdev_s *priv = &g_usbdev;
  uint32_t disr, portsc1, n;

  usbtrace(TRACE_INTENTRY(LPC313X_TRACEINTID_USB), 0);

  /* Read the interrupts and then clear them */
  disr = lpc313x_getreg(LPC313X_USBDEV_USBSTS);
  lpc313x_putreg(disr, LPC313X_USBDEV_USBSTS);

  if (disr & USBDEV_USBSTS_URI)
    {
      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_DEVRESET),0);

      lpc313x_usbreset(priv);

      usbtrace(TRACE_INTEXIT(LPC313X_TRACEINTID_USB), 0);
      return OK;
  }
  
  if (disr & USBDEV_USBSTS_SLI)
    {
      // FIXME: what do we need to do here...
      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_SUSPENDCHG),0);
    }

  if (disr & USBDEV_USBSTS_PCI)
    {
      portsc1 = lpc313x_getreg(LPC313X_USBDEV_PORTSC1);

      if (portsc1 & USBDEV_PRTSC1_HSP)
	priv->usbdev.speed = USB_SPEED_HIGH;
      else
	priv->usbdev.speed = USB_SPEED_FULL;

      if (portsc1 & USBDEV_PRTSC1_FPR)
        {
	  /* FIXME: this occurs because of a J-to-K transition detected
	   *         while the port is in SUSPEND state - presumambly this 
	   *         is where the host is resuming the device?
	   *
	   *  - but do we need to "ack" the interrupt
	   */
	}
    }
  
#ifdef CONFIG_LPC313X_USBDEV_FRAME_INTERRUPT
  if (disr & USBDEV_USBSTT_SRI)
    {
      usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_FRAME), 0);
      
      priv->sof = (int)lpc313x_getreg(LPC313X_USBDEV_FRINDEX_OFFSET); 
    }
#endif

  if (disr & USBDEV_USBSTS_UEI)
    {
      /* FIXME: these occur when a transfer results in an error condition
       *        it is set alongside USBINT if the DTD also had its IOC 
       *        bit set. */
    }
  
  if (disr & USBDEV_USBSTS_UI)
    {
      /* Handle completion interrupts */
      uint32_t mask = lpc313x_getreg (LPC313X_USBDEV_ENDPTCOMPLETE);

      if (mask)
        {
	  // Clear any NAK interrupt and completion interrupts
	  lpc313x_putreg (mask, LPC313X_USBDEV_ENDPTNAK);
	  lpc313x_putreg (mask, LPC313X_USBDEV_ENDPTCOMPLETE);
	  
	  if (mask & LPC313X_ENDPTMASK(0))
	    lpc313x_ep0complete(priv, 0);
	  if (mask & LPC313X_ENDPTMASK(1))
	    lpc313x_ep0complete(priv, 1);
	  
	  for (n = 1; n < LPC313X_NLOGENDPOINTS; n++)
	    {
	      if (mask & LPC313X_ENDPTMASK((n<<1)))
		lpc313x_epcomplete (priv, (n<<1));
	      if (mask & LPC313X_ENDPTMASK((n<<1)+1))
		lpc313x_epcomplete(priv, (n<<1)+1);
	    }
	}

      /* Handle setup interrupts */
      uint32_t setupstat = lpc313x_getreg(LPC313X_USBDEV_ENDPTSETUPSTAT);
      if (setupstat)
        {
	  /* Clear the endpoint complete CTRL OUT and IN when a Setup is received */
	  lpc313x_putreg (LPC313X_ENDPTMASK(LPC313X_EP0_IN) | LPC313X_ENDPTMASK(LPC313X_EP0_OUT), 
			  LPC313X_USBDEV_ENDPTCOMPLETE);
	  
	  if (setupstat & LPC313X_ENDPTMASK(LPC313X_EP0_OUT))
	  {
	    usbtrace(TRACE_INTDECODE(LPC313X_TRACEINTID_EP0SETUP), setupstat);
	    lpc313x_ep0setup(priv);
	  }
	}
    }

  if (disr & USBDEV_USBSTS_NAKI)
    {
      uint32_t pending = lpc313x_getreg(LPC313X_USBDEV_ENDPTNAK) & lpc313x_getreg(LPC313X_USBDEV_ENDPTNAKEN);
      if (pending)
        {
	  /* We shouldn't see NAK interrupts except on Endpoint 0 */
	  if (pending & LPC313X_ENDPTMASK(0))
	      lpc313x_ep0nak(priv, 0);
	  if (pending & LPC313X_ENDPTMASK(1))
	      lpc313x_ep0nak(priv, 1);
	}
      
